app/controllers/posts_controller.rb

  def index
    if params[:q] && !params[:q].empty?
      @tags = params[:q].split(' ')
      @posts = Post.tagged_with(@tags).desc.paginate(page: params[:page], per_page: 40)
---
SELECT "posts".* FROM "posts" ORDER BY created_at DESC
SELECT COUNT(*) FROM "posts"

  def create
    @post = Post.new post_params
    if @post.save
---
INSERT INTO "posts" ("title", "created_at", "updated_at", "picture") VALUES (?, ?, ?, ?)  [["title", "dana scully"], ["created_at", "2017-10-22 19:33:00.657700"], ["updated_at", "2017-10-22 19:33:00.657700"], ["picture", "k0qtadphzzmdx9hvfazl.png"]]